Revit 2026 API

# NumericRevisionSettingsIsEqual Method

---

Determines whether a specified NumericRevisionSettings is the same as 'this'.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsEqual(
	NumericRevisionSettings other
)
```
```vb
Public Function IsEqual (
	other As NumericRevisionSettings
) As Boolean
```
```cpp
public:
bool IsEqual(
	NumericRevisionSettings^ other
)
```
```fsharp
member IsEqual :
        other : NumericRevisionSettings -> bool
```

#### Parameters

other NumericRevisionSettings
     The specified NumericRevisionSettings with which to compare.

#### Return Value

Boolean True, if two NumericRevisionSettings are the same.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The two NumericRevisionSettings are regarded as the same only if they have the same start number, prefix and suffix strings.

#### Reference

NumericRevisionSettings Class

Autodesk.Revit.DB Namespace